{"config": [{"config": {"bias_constraint": null, "padding": "valid", "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "name": "conv2d_1", "strides": [1, 1], "activation": "relu", "activity_regularizer": null, "batch_input_shape": [null, 60, 60, 3], "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "filters": 8, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"bias_constraint": null, "padding": "valid", "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_2", "strides": [1, 1], "activation": "relu", "activity_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "filters": 16, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "padding": "valid", "trainable": true, "name": "max_pooling2d_1", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"bias_constraint": null, "padding": "valid", "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_3", "strides": [1, 1], "activation": "sigmoid", "activity_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "filters": 24, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "padding": "valid", "trainable": true, "name": "max_pooling2d_2", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 128, "name": "dense_1", "activation": "relu", "activity_regularizer": null, "use_bias": true, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "rate": 0.4, "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1, "name": "dense_2", "activation": "softmax", "activity_regularizer": null, "use_bias": true, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.0.4", "class_name": "Sequential"}