{"keras_version": "2.0.2", "config": [{"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_1", "batch_input_shape": [null, 60, 60, 3], "dtype": "float32", "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "padding": "valid", "filters": 8, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": true}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "padding": "valid", "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_2", "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_1", "padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "padding": "valid", "filters": 24, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_3", "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_2", "padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "sigmoid", "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "padding": "valid", "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_4", "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_regularizer": null, "units": 128, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true, "use_bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.4, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_regularizer": null, "units": 1, "bias_regularizer": null, "activity_regularizer": null, "activation": "softmax", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true, "use_bias": true}}], "backend": "tensorflow", "class_name": "Sequential"}